server/app/controllers/news_articles_controller.rb

    def create
            @news_article=NewsArticle.new  news_article_params
            @news_article.user=current_user
            if @news_article.save
---
INSERT INTO "news_articles" ("title", "description", "published_at", "view_count", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        if @news_article.update news_article_params
---
UPDATE "news_articles" SET "title" = $1, "updated_at" = $2 WHERE "news_articles"."id" = $3  [["title", "Investor sales specialist9 plus some changes!!!"], ["updated_at", "2021-01-20 21:28:25.995953"], ["id", 9]]

    def destroy
        if can?(:delete,@news_article)
            @news_article.destroy
---
DELETE FROM "news_articles" WHERE "news_articles"."id" = $1  [["id", 12]]

    def find_news_article
        @news_article=NewsArticle.find params[:id]
---
SELECT "news_articles".* FROM "news_articles" WHERE "news_articles"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]